# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop(columns=['Unnamed: 0','Id'])

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [5]:
#

baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [9]:
# you don't want to sum the Year column, so you delete it
# del baby_names["Year"]

# group the data
names = baby_names.groupby("Name").sum()

# print the first 5 observations
names.head()

# print the size of the dataset
print(names.shape)

# sort it from the biggest value to the smallest one
names.sort_values("Count", ascending = 0).head()


print(names['Count'])

(17632, 5)
Name
Aaban        12
Aadan        23
Aadarsh       5
Aaden      3426
Aadhav        6
           ...
Zyra         42
Zyrah        11
Zyren         6
Zyria        59
Zyriah       58
Name: Count, Length: 17632, dtype: int64

### Step 8. How many different names exist in the dataset?

In [11]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [ ]:
names.Count.idxmax()

# OR

# names[names.Count == names.Count.max()]

### Step 10. How many different names have the least occurrences?

In [12]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [13]:
names[names.Count == names.Count.median()]

         Unnamed: 0        Id    Gender             State  Count
Name
Aishani     7810519   7810526   FFFFFFF    CACACACACAILNJ     49
Alara      18841019  18841027  FFFFFFFF  CACACAFLNYNYNYTX     49
Alysse     22629397  22629405  FFFFFFFF  CACACAMINYTXTXTX     49
Ameir      21780403  21780411  MMMMMMMM  CAMIMIMIMIMINYOH     49
Anely       4349533   4349541  FFFFFFFF  CACACACACACACACA     49
...             ...       ...       ...               ...    ...
Sriram      9208196   9208203   MMMMMMM    CACACACACACATX     49
Trinton    32822294  32822302  MMMMMMMM  FLLAOKTXTXTXTXTX     49
Vita       10241625  10241632   FFFFFFF    CACACACACANYNY     49
Yoni        6439146   6439154  MMMMMMMM  CACACACACACAFLFL     49
Zuleima     3521366   3521373   FFFFFFF    AZCACACACACACA     49

[66 rows x 5 columns]

### Step 12. What is the standard deviation of names?

In [14]:
names.Count.std()

np.float64(11006.06946789057)

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [15]:
names.describe()

         Unnamed: 0            Id          Count
count  1.763200e+04  1.763200e+04   17632.000000
mean   1.631922e+08  1.631922e+08    2008.932169
std    3.504512e+08  3.504513e+08   11006.069468
min    8.606400e+04  8.606500e+04       5.000000
25%    4.918374e+06  4.918375e+06      11.000000
50%    1.963462e+07  1.963463e+07      49.000000
75%    1.071826e+08  1.071826e+08     337.000000
max    3.223035e+09  3.223036e+09  242874.000000